{
  "basics": {
    "name": "Alec Rust",
    "label": "Web Developer",
    "picture": "https://cv.alecrust.com/alec-rust.jpg",
    "email": "me@alecrust.com",
    "website": "https://www.alecrust.com/",
    "summary": "Experienced web developer with a dedication to accessibility, performance, SEO and meticulously crafted mobile-first user interfaces.",
    "location": {
      "city": "London",
      "countryCode": "UK"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "AlecRust",
        "url": "https://github.com/AlecRust"
      },
      {
        "network": "Twitter",
        "username": "AlecRust",
        "url": "https://twitter.com/AlecRust"
      },
      {
        "network": "LinkedIn",
        "username": "alecrust",
        "url": "https://www.linkedin.com/in/alecrust/"
      }
    ]
  },
  "work": [
    {
      "company": "Featurist",
      "position": "Head of UI/UX",
      "website": "https://www.featurist.co.uk/",
      "startDate": "2016-07-04",
      "summary": "Working for a small London-based consultancy I led the front end development of all projects, ranging from small startup MVPs to replacing large legacy systems for established companies.",
      "highlights": [
        "Steering the UI/UX process for all projects, gaining invaluable leadership and project management experience.",
        "Working on a mixture of greenfield projects and replacing legacy systems, using wide range of tech from Node to Rails.",
        "Developing a deeper understanding of various industries through diverse projects, broadening my perspective approach."
      ]
    },
    {
      "company": "BBC",
      "position": "Senior Web Developer",
      "website": "http://www.bbc.co.uk/bbcthree",
      "startDate": "2015-06-01",
      "endDate": "2016-06-30",
      "summary": "Worked on a team developing a modern, magazine-style web application to replace the BBC Three TV channel. Used Node and React to meet a range of stakeholder needs and deliver an engaging user experience.",
      "highlights": [
        "Conducting user testing with our target audience, which led to the development of interactive and fun website features.",
        "Creating an internal library for efficient and consistent display of BBC content 'cards'.",
        "Expanding my technical skill set by learning and implementing new technologies like Node, React, Webpack, and Babel."
      ]
    },
    {
      "company": "Shopa",
      "position": "Director of Front End Engineering",
      "website": "https://shopa.com/",
      "startDate": "2014-05-01",
      "endDate": "2015-04-16",
      "summary": "Led the front end development as the company expanded to over 20 employees and secured additional investment. Enhanced the technology stack to ensure it could scale alongside the company's growth.",
      "highlights": [
        "Managing end-to-end website maintenance and exploring a variety of dev ops tools.",
        "Balancing business expectations with technical capabilities to meet project goals.",
        "Expanding my knowledge and skills by learning technologies like Go, Elasticsearch, and Gulp."
      ]
    },
    {
      "company": "Shopa",
      "position": "Front End Developer",
      "website": "https://shopa.com/",
      "startDate": "2014-01-13",
      "endDate": "2014-05-01",
      "summary": "Joined Shopa, a new social shopping startup, to contribute to the development of their initial web and mobile applications. Upon securing investment, transitioned into a permanent role to build the team and oversee front end development.",
      "highlights": [
        "Iterating on prototypes and ideas rapidly to ensure a fast feedback loop.",
        "Experimenting with innovative technologies in a collaborative and relaxed work environment.",
        "Gaining knowledge of Ruby on Rails and adopting new methodologies like SUIT CSS."
      ]
    },
    {
      "company": "Universal Music Group",
      "position": "Front End Developer",
      "website": "http://www.universalmusic.com/",
      "startDate": "2011-12-12",
      "endDate": "2014-01-10",
      "summary": "Worked on a diverse range of artist and record label websites, gaining familiarity with the Umbraco CMS. Gave presentations on mobile-first best practices and contributed to the development of tools and best practices for the team.",
      "highlights": [
        "Leading the front end development for the new classical music site, Sinfini Music.",
        "Launching a mobile-first website for the Mercury Records music label.",
        "Creating the 'UMG Boilerplate' to streamline application building for teams."
      ]
    },
    {
      "company": "BBC Worldwide",
      "position": "Commercial Developer",
      "website": "http://www.bbc.com/",
      "startDate": "2010-10-01",
      "endDate": "2011-12-01",
      "summary": "Joined the BBC.com development team to contribute to the launch and maintenance of a new site version for international users. Managed analytics requirements and advertising code, often requiring innovative technical solutions.",
      "highlights": [
        "Completing Adobe SiteCatalyst Implementation Training to enhance site analytics.",
        "Analysing global traffic patterns using Keynote for improved user understanding.",
        "Learning about and implementing continuous integration, TDD, and BDD in the workflow."
      ]
    },
    {
      "company": "BBC Worldwide",
      "position": "User Interface Developer",
      "website": "https://www.bbc.co.uk/",
      "startDate": "2009-07-01",
      "endDate": "2010-10-01",
      "summary": "Worked within the Digital Delivery team maintaining 'passion sites' like BBC Good Food, Gardeners' World, and Radio Times. Worked across multiple projects, consistently solving problems across a network of websites.",
      "highlights": [
        "Rebuilding the Top Gear website for the UK audience.",
        "Developing new features and microsites for various BBC websites.",
        "Gaining knowledge about website localisation and GeoIP technologies."
      ]
    },
    {
      "company": "BBC",
      "position": "Front End Developer",
      "website": "https://www.bbc.co.uk/",
      "startDate": "2008-07-01",
      "endDate": "2009-07-01",
      "summary": "Selected for the development team that built the customisable, widget-based BBC homepage for domestic users. Worked with BBC Public Service on this project before transitioning to BBC Worldwide, the commercial arm of the BBC.",
      "highlights": [
        "Building a high-traffic website accessed by millions of users.",
        "Honing software development best practices in a collaborative team environment.",
        "Learning about dev ops in the context of a large site, including CDNs, caching layers, etc."
      ]
    },
    {
      "company": "Alec Rust Ltd",
      "position": "Freelance Developer/Designer",
      "website": "https://www.alecrust.com/",
      "startDate": "2004-01-01",
      "endDate": "2009-06-01",
      "summary": "As a freelancer, I gained comprehensive knowledge of web development, from design to databases and security. Delivered solutions for small businesses using software like WordPress, Drupal, and Magento, as well as creating bespoke applications and user interfaces for start-ups.",
      "highlights": [
        "Gaining exposure to diverse businesses and their unique requirements.",
        "Developing a scalable solution for hosting and monitoring numerous websites.",
        "Launching a question-and-answer platform for general contractors."
      ]
    },
    {
      "company": "RAPP",
      "position": "Web Developer",
      "website": "http://www.rapp.com/",
      "startDate": "2007-10-01",
      "endDate": "2008-06-01",
      "summary": "Worked in the technology department of a large agency, learning about efficient development workflows for large teams and managing deadline expectations. Utilised technologies such as Microsoft SourceSafe and adhered to an extensive QA process for our work.",
      "highlights": [
        "Building HTML emails for high-profile clients such as Apple, Barclays, and Crisis.",
        "Launching a health information website for Pfizer.",
        "Learning about target audiences through formal user testing."
      ]
    }
  ],
  "skills": [
    {
      "name": "Technical Skills",
      "keywords": [
        "Modern HTML, CSS, JavaScript",
        "Performance Optimisation & Scalability",
        "Web Accessibility Standards",
        "SEO & Web Analytics Integration",
        "Complex UI/UX Design & Development",
        "Back end integration with UI (Node.js, RoR, APIs)"
      ]
    },
    {
      "name": "Soft Skills",
      "keywords": [
        "Leadership",
        "Project Management",
        "Communication",
        "Problem-Solving",
        "Team Collaboration",
        "Detail-Oriented"
      ]
    }
  ]
}
