{
  "basics": {
    "name": "Alec Rust",
    "label": "Senior Web Developer",
    "picture": "alec-rust.jpg",
    "email": "me@alecrust.com",
    "website": "https://www.alecrust.com/",
    "summary": "Experienced self-taught developer with leadership experience. Dedicated to accessibility, performance, SEO and crafted mobile-first user interfaces.",
    "location": {
      "city": "London",
      "countryCode": "UK"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "AlecRust",
        "url": "https://github.com/AlecRust"
      },
      {
        "network": "Twitter",
        "username": "AlecRust",
        "url": "https://twitter.com/AlecRust"
      },
      {
        "network": "LinkedIn",
        "username": "alecrust",
        "url": "https://www.linkedin.com/in/alecrust/"
      }
    ]
  },
  "work": [
    {
      "company": "Featurist",
      "position": "Head of UI/UX",
      "website": "https://featurist.co.uk/",
      "startDate": "2016-07-04",
      "summary": "At Featurist, a London-based consultancy, I took the helm of front end development across projects, which included startup MVPs and replacing extensive legacy systems for established companies.",
      "highlights": [
        "Led the UI/UX process for all projects, honing my leadership and project management skills.",
        "Worked on greenfield projects and legacy system replacements, utilising a diverse tech stack from Node.js to Rails.",
        "Gained insights into various industries through diverse projects, which improved my problem-solving approach."
      ]
    },
    {
      "company": "BBC",
      "position": "Senior Web Developer",
      "website": "http://www.bbc.co.uk/bbcthree",
      "startDate": "2015-06-01",
      "endDate": "2016-06-30",
      "summary": "At my second stint at the BBC I was part of the development team that built a modern, magazine-style website to transition BBC Three from a TV channel to the web. Utilising Node.js and React, we focused on fulfilling diverse stakeholder needs while ensuring an engaging user experience.",
      "highlights": [
        "Conducted user testing, which informed the development of interactive features, enhancing user engagement.",
        "Developed an internal library for efficient and consistent display of BBC content 'cards', streamlining content management.",
        "Adopted and strengthened my abilities in new technologies such as Node.js, React, webpack, and Babel."
      ]
    },
    {
      "company": "Shopa",
      "position": "Director of Front End Engineering",
      "website": "https://shopa.com/",
      "startDate": "2014-05-01",
      "endDate": "2015-04-16",
      "summary": "As Director of Front End Engineering at Shopa, I took charge of front end development while the company expanded and secured additional investment. I focused on evolving the technology stack to ensure scalability in line with company growth.",
      "highlights": [
        "Oversaw front end implementation and maintenance, alongside dev ops tools ensuring website reliability.",
        "Navigated the balance between business expectations and technical capabilities, delivering on project objectives.",
        "Broadened my expertise by learning about technologies such as Go, Elasticsearch, and Gulp."
      ]
    },
    {
      "company": "Shopa",
      "position": "Front End Developer",
      "website": "https://shopa.com/",
      "startDate": "2014-01-13",
      "endDate": "2014-05-01",
      "summary": "At Shopa, a social shopping startup, I was instrumental in developing the initial web and mobile applications. I then transitioned into a development-management role to build a capable team and oversee front end development.",
      "highlights": [
        "Rapidly iterated on prototypes, establishing a fast feedback loop crucial to the startup phase.",
        "Experimented with cutting-edge technologies in a collaborative setting.",
        "Enhanced my skill set with Ruby on Rails and integrated new methodologies like SUIT CSS."
      ]
    },
    {
      "company": "Universal Music Group",
      "position": "Front End Developer",
      "website": "http://www.universalmusic.com/",
      "startDate": "2011-12-12",
      "endDate": "2014-01-10",
      "summary": "At Universal Music Group, I worked on a range of artist and record label websites. I introduced mobile-first best practices through presentations and actively contributed to the development of tools and best practices for the team.",
      "highlights": [
        "Led front end development for the Sinfini Music site, delivering a new platform for classical music enthusiasts.",
        "launched a new website for Mercury Records, enhancing the mobile user experience.",
        "Created the 'UMG Boilerplate', a tool that streamlined development processes for teams."
      ]
    },
    {
      "company": "BBC Worldwide",
      "position": "Commercial Developer",
      "website": "http://www.bbc.com/",
      "startDate": "2010-10-01",
      "endDate": "2011-12-01",
      "summary": "In the BBC.com development team I contributed to the launch and maintenance of an updated BBC.com for international users. I helped manage analytics and advertising code, often requiring innovative technical solutions.",
      "highlights": [
        "Completed Adobe SiteCatalyst Implementation Training to improve site analytics.",
        "Analysed global traffic patterns using Keynote for insightful user understanding.",
        "Learned about and implemented continuous integration, TDD, and BDD."
      ]
    },
    {
      "company": "BBC Worldwide",
      "position": "User Interface Developer",
      "website": "https://www.bbc.co.uk/",
      "startDate": "2009-07-01",
      "endDate": "2010-10-01",
      "summary": "At BBC Worldwide, as part of the Digital Delivery team, I worked on maintaining and enhancing several 'passion sites' including BBC Good Food, Gardeners' World, and Radio Times, focusing on problem-solving and user experience improvement.",
      "highlights": [
        "Participated in rebuilding the Top Gear website, optimising navigation and performance.",
        "Developed and integrated new features and microsites for various BBC websites.",
        "Expanded knowledge in website localisation and effectively applied GeoIP technologies."
      ]
    },
    {
      "company": "BBC",
      "position": "Front End Developer",
      "website": "https://www.bbc.co.uk/",
      "startDate": "2008-07-01",
      "endDate": "2009-07-01",
      "summary": "Selected for the development team that revamped the BBC domestic homepage into a customisable, widget-based layout, enhancing usability for a large audience.",
      "highlights": [
        "Contributed to a homepage redesign that improved usability for millions of daily users.",
        "Collaborated closely with a skilled team, refining development best practices.",
        "Dived into dev ops, learning about CDNs and caching strategies for large-scale websites."
      ]
    },
    {
      "company": "Alec Rust Ltd",
      "position": "Freelance Developer/Designer",
      "website": "https://www.alecrust.com/",
      "startDate": "2004-01-01",
      "endDate": "2009-06-01",
      "summary": "As a freelance developer, I became adept in a wide range of areas of web development and catered to diverse client needs, from small businesses to start-ups. I utilised popular CMS platforms and also engineered bespoke solutions.",
      "highlights": [
        "Developed websites for a range of businesses, adapting to unique needs.",
        "Implemented a scalable hosting and monitoring solution for multiple clients.",
        "Launched a Q&A platform for general contractors, among other projects."
      ]
    },
    {
      "company": "RAPP",
      "position": "Web Developer",
      "website": "http://www.rapp.com/",
      "startDate": "2007-10-01",
      "endDate": "2008-06-01",
      "summary": "At RAPP, I honed my skills in a fast-paced agency setting, mastering development workflows and quality assurance processes, and contributing to projects for large clients.",
      "highlights": [
        "Contributed to the launch of Pfizer’s health information website.",
        "Built HTML emails for high-profile clients like Apple and Barclays.",
        "Gained insights into user preferences through formal user testing."
      ]
    }
  ],
  "skills": [
    {
      "name": "Technical Skills",
      "keywords": [
        "Modern HTML5, CSS3, ES6",
        "React, Vue.js, Node.js, Ruby on Rails",
        "Bootstrap, Tailwind, Material UI etc.",
        "webpack, Babel, ESLint, Prettier, Jest",
        "CI with GitHub Actions, CircleCI etc.",
        "WordPress LAMP stack with Bootstrap, jQuery etc.",
        "Strong design sensibilities, Sketch, Figma etc.",
        "Web Accessibility Standards",
        "Performance Optimisation & Scalability",
        "SEO expertise including analytics integration"
      ]
    },
    {
      "name": "Soft Skills",
      "keywords": [
        "Leadership",
        "Project Management",
        "Communication",
        "Problem-Solving",
        "Team Collaboration",
        "Detail-Oriented"
      ]
    }
  ]
}
