{
  "basics": {
    "name": "Alec Rust",
    "label": "Web Developer",
    "picture": "https://cv.alecrust.com/alec-rust.jpg",
    "email": "me@alecrust.com",
    "website": "https://www.alecrust.com/",
    "summary": "Experienced web developer with a dedication to accessibility, performance, SEO and meticulously crafted mobile-first user interfaces.",
    "location": {
      "city": "London",
      "countryCode": "UK"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "AlecRust",
        "url": "https://github.com/AlecRust"
      },
      {
        "network": "Twitter",
        "username": "AlecRust",
        "url": "https://twitter.com/AlecRust"
      },
      {
        "network": "LinkedIn",
        "username": "alecrust",
        "url": "https://www.linkedin.com/in/alecrust/"
      }
    ]
  },
  "work": [
    {
      "company": "Featurist",
      "position": "Head of UI/UX",
      "website": "https://www.featurist.co.uk/",
      "startDate": "2016-07-04",
      "summary": "I'm currently working with a London-based agency building websites and applications for a wide range of clients."
    },
    {
      "company": "BBC",
      "position": "Senior Web Developer",
      "website": "http://www.bbc.co.uk/bbcthree",
      "startDate": "2015-06-01",
      "endDate": "2016-06-30",
      "summary": "The BBC wanted a modern stream/magazine style web application to replace the BBC Three TV channel. I worked with a small team to deliver this Node/React project and satisfy the business, editorial, design and analytics requirements.",
      "highlights": [
        "User testing of target audience and development of fun website features",
        "Developing an internal library for displaying “cards” of BBC content",
        "Learning new technologies such as Node, React, Webpack and Babel"
      ]
    },
    {
      "company": "Shopa",
      "position": "Director of Front End Engineering",
      "website": "https://shopa.com/",
      "startDate": "2014-05-01",
      "endDate": "2015-04-16",
      "summary": "In this permanent role I led the front end development of the company as the team grew to over 20 employees and received further investment. Over this time we improved the technology stack to scale with the company.",
      "highlights": [
        "Maintaining the website end-to-end and trying various dev ops tools",
        "Managing business expectations in combination with technical limitations",
        "Learning about technologies such as Go, Elasticsearch and Gulp"
      ]
    },
    {
      "company": "Shopa",
      "position": "Front End Developer",
      "website": "https://shopa.com/",
      "startDate": "2014-01-13",
      "endDate": "2014-05-01",
      "summary": "I joined the new social shopping start-up Shopa to help build their early web and mobile app offering. The company received investment and I took a permanent position to help build the team and manage the front end.",
      "highlights": [
        "Iterating on new prototypes and ideas with a fast feedback loop",
        "Experimenting with new technologies in a friendly relaxed environment",
        "Learning Ruby on Rails and using new methodologies such as SUIT CSS"
      ]
    },
    {
      "company": "Universal Music Group",
      "position": "Front End Developer",
      "website": "http://www.universalmusic.com/",
      "startDate": "2011-12-12",
      "endDate": "2014-01-10",
      "summary": "Working with Universal Music I was able to work on many different artist and record label websites and get familiar with the Umbraco CMS. I provided presentations on mobile-first best practices and helped develop tools and best practices for the team.",
      "highlights": [
        "Leading the front end on the new classical music site Sinfini Music",
        "Launching new mobile-first website for Mercury Records music label",
        "Developing the “UMG Boilerplate” to help teams quickly build applications"
      ]
    },
    {
      "company": "BBC Worldwide",
      "position": "Commercial Developer",
      "website": "http://www.bbc.com/",
      "startDate": "2010-10-01",
      "endDate": "2011-12-01",
      "summary": "I joined the BBC.com development team to help launch and maintain a new version of the site for international users. My role also had a focus on managing analytics requirement and advertising code for the site, which often required challenging technical solutions.",
      "highlights": [
        "Completing Adobe SiteCatalyst Implementation Training",
        "Analysing traffic from around the world using Keynote",
        "Learning about continuous integration, TDD and BDD"
      ]
    },
    {
      "company": "BBC Worldwide",
      "position": "User Interface Developer",
      "website": "https://www.bbc.co.uk/",
      "startDate": "2009-07-01",
      "endDate": "2010-10-01",
      "summary": "Working in the Digital Delivery team I maintained the “passion sites” such as BBC Good Food, Gardeners' World and Radio Times. I had the opportunity to work with multiple different code bases and solving problems in a consistent way across a network of websites.",
      "highlights": [
        "Rebuilding the UK version of the Top Gear website",
        "Developing new features and microsites for the BBC websites",
        "Learning about website localisation and GeoIP technologies"
      ]
    },
    {
      "company": "BBC",
      "position": "Front End Developer",
      "website": "https://www.bbc.co.uk/",
      "startDate": "2008-07-01",
      "endDate": "2009-07-01",
      "summary": "I was fortunate enough to be selected for the development team which built the customisable widget-based BBC homepage for domestic users. I worked with BBC Public Service for this project before moving to BBC Worldwide, the commercial arm of the BBC.",
      "highlights": [
        "Building a high profile website visited by millions of users",
        "Honing software development best practices in a team environment",
        "Learning about dev ops of a large site such as CDNs, caching layers etc."
      ]
    },
    {
      "company": "Alec Rust Ltd",
      "position": "Freelance Developer/Designer",
      "website": "https://www.alecrust.com/",
      "startDate": "2004-01-01",
      "endDate": "2009-06-01",
      "summary": "As a freelancer I had the opportunity to learn about all aspects of web development from design to databases and security. I delivered work for small businesses with software such as WordPress, Drupal and Magento as well as bespoke applications or user interfaces for start-ups.",
      "highlights": [
        "Exposure to a wide range of different businesses and requirements",
        "Developing a scalable solution for hosting and monitoring many websites",
        "Launching a question/answer platform for general contractors"
      ]
    },
    {
      "company": "RAPP",
      "position": "Web Developer",
      "website": "http://www.rapp.com/",
      "startDate": "2007-10-01",
      "endDate": "2008-06-01",
      "summary": "Working in the technology department for a large agency taught me about good development workflows for large teams and managing deadline expectations. We used technologies such as Microsoft SourceSafe and had an extensive QA process for our work.",
      "highlights": [
        "Building HTML emails for clients such as Apple, Barclays, Crisis",
        "Launching health information website for Pfizer",
        "Learning about target audience through formal user testing"
      ]
    }
  ],
  "skills": [
    {
      "name": "Development Skills",
      "keywords": [
        "Modern HTML, CSS, JavaScript",
        "Progressive Enhancement",
        "Mobile-first/responsive",
        "Accessibility, performance, SEO"
      ]
    },
    {
      "name": "Other Skills",
      "keywords": [
        "Agile, Waterfall, TDD, BDD",
        "Unit/integration testing",
        "Cross-browser testing",
        "Continuous integration and deployment",
        "Excellent verbal/written skills"
      ]
    },
    {
      "name": "Tools/Technologies",
      "keywords": [
        "Node, React, Webpack, Babel",
        "PostCSS, Sass, LESS, Stylus",
        "Adobe Photoshop/Illustrator",
        "Affinity Photo/Designer",
        "Git, SVN, Mercurial,",
        "GitHub, Kiln, Trello, JIRA",
        "Rails, Heroku, OpenShift",
        "Grunt, Gulp and NPM scripts",
        "SendGrid, MailChimp, Mailgun",
        "jQuery, WordPress, MySQL",
        "Umbraco .NET CMS",
        "TeamCity, Hudson, CircleCI, Jenkins"
      ]
    }
  ],
  "interests": [
    {
      "name": "Outdoors",
      "keywords": [
        "Cycling",
        "Sailing",
        "Snowboarding"
      ]
    },
    {
      "name": "Indoors",
      "keywords": [
        "Personal projects",
        "Music",
        "Politics"
      ]
    }
  ]
}
